#                        ---------------------------- Pandas Notes -----------------------------------

### 1. What is pandas

In [1]:

# - Pandas is a Python package providing fast, flexible, and expressive data structures designed to make working 
# with “relational” or “labeled” data both easy and intuitive. 

# - It aims to be the fundamental high-level building block for doing practical, real-world data analysis in Python. 

# - Additionally, it has the broader goal of becoming the most powerful and flexible open source data analysis/manipulation 
# tool available in any language. 

# - It is already well on its way toward this goal.

### 2. Basic Data Structures in Pandas

In [2]:

# Pandas provides two types of classes for handling data:

# 1. Series: a one-dimensional labeled array holding data of any type , such as integers, strings, Python objects etc.

# 2. DataFrame : a two-dimensional data structure that holds data like a two-dimension array or a table with rows and columns.

### 3. How to import pandas in our project

In [3]:
import pandas as pd

In [4]:
# checking Version 
pd.__version__

'2.1.1'

### 4. Object Creation

__Series__

In [5]:
# creating a series 's' by passing a list of values , letting pandas creae a default RangeIndex
s = pd.Series([1,2,3,None,5,6])
s

0    1.0
1    2.0
2    3.0
3    NaN
4    5.0
5    6.0
dtype: float64

In [6]:
# -----------------

__DataFrame__

In [7]:
#creating a DataFrame using a NumPy array with a datetime index using date_range() and labeled columns

dates = pd.date_range('1/1/2023',periods=6)    #period=days
dates

DatetimeIndex(['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04',
               '2023-01-05', '2023-01-06'],
              dtype='datetime64[ns]', freq='D')

In [8]:
import numpy as np
# DataFrame alias to df

df = pd.DataFrame(np.random.randn(6,4),index=dates,columns=['A','B','C','D'])
df

                   A         B         C         D
2023-01-01 -0.290386  1.013286 -0.183850  1.702461
2023-01-02 -0.735963 -0.473680 -0.528591  1.186680
2023-01-03  2.020277  0.861204 -0.149633  0.419033
2023-01-04  0.547110  0.325433  0.878352 -0.589470
2023-01-05 -0.080536 -1.864743 -0.100080 -1.145679
2023-01-06  1.253035  2.231265  0.938520  0.028004

In [9]:
# Creating a dataframe by passing a dictionary of objects where keys is the column labels and
# values are the column values

df2 = pd.DataFrame({
    'A':1.0,
    'B':pd.Timestamp('20230102'),
    'C':pd.Series(1,index=list(range(4)),dtype='float32'),
    'D':np.array([3]*4),
    'E':pd.Categorical(['test','train','test','train']),
    'F':'foo'
})
df2

     A          B    C  D      E    F
0  1.0 2023-01-02  1.0  3   test  foo
1  1.0 2023-01-02  1.0  3  train  foo
2  1.0 2023-01-02  1.0  3   test  foo
3  1.0 2023-01-02  1.0  3  train  foo

In [10]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int64
E         category
F           object
dtype: object

### 5. Viewing data

In [11]:
#df.head() shows top few rows of the data frame
df.head()

                   A         B         C         D
2023-01-01 -0.290386  1.013286 -0.183850  1.702461
2023-01-02 -0.735963 -0.473680 -0.528591  1.186680
2023-01-03  2.020277  0.861204 -0.149633  0.419033
2023-01-04  0.547110  0.325433  0.878352 -0.589470
2023-01-05 -0.080536 -1.864743 -0.100080 -1.145679

In [12]:
#passing a parameter in head() will show same number of rows from the top
df.head(2)

                   A         B         C         D
2023-01-01 -0.290386  1.013286 -0.183850  1.702461
2023-01-02 -0.735963 -0.473680 -0.528591  1.186680

In [13]:
# df.tail() will show bottom rows from the datafarme
df.tail()

                   A         B         C         D
2023-01-02 -0.735963 -0.473680 -0.528591  1.186680
2023-01-03  2.020277  0.861204 -0.149633  0.419033
2023-01-04  0.547110  0.325433  0.878352 -0.589470
2023-01-05 -0.080536 -1.864743 -0.100080 -1.145679
2023-01-06  1.253035  2.231265  0.938520  0.028004

In [14]:
#df.tail(3) will show last 3 rows from the dataframe
df.tail(3)

                   A         B         C         D
2023-01-04  0.547110  0.325433  0.878352 -0.589470
2023-01-05 -0.080536 -1.864743 -0.100080 -1.145679
2023-01-06  1.253035  2.231265  0.938520  0.028004

In [15]:
#shows all the indexes name(all rows)
df.index

DatetimeIndex(['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04',
               '2023-01-05', '2023-01-06'],
              dtype='datetime64[ns]', freq='D')

In [16]:
#show all columns name
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [17]:
#to see numpy representation of the data , without rows and columns label
df.to_numpy()

array([[-0.2903865 ,  1.01328645, -0.1838499 ,  1.70246083],
       [-0.73596283, -0.47367963, -0.52859114,  1.18668007],
       [ 2.02027738,  0.86120432, -0.14963285,  0.41903277],
       [ 0.54711023,  0.32543326,  0.87835228, -0.58946958],
       [-0.08053626, -1.86474291, -0.10007953, -1.14567907],
       [ 1.25303464,  2.23126503,  0.93851958,  0.02800383]])

In [18]:
''' NOTE: 
NumPy arrays have one dtype for the entire array while pandas DataFrames have one dtype per column. 
When you call DataFrame.to_numpy(), pandas will find the NumPy dtype that can hold all of the dtypes in the DataFrame. 

If the common data type is object, DataFrame.to_numpy() will require copying data.
'''

' NOTE: \nNumPy arrays have one dtype for the entire array while pandas DataFrames have one dtype per column. \nWhen you call DataFrame.to_numpy(), pandas will find the NumPy dtype that can hold all of the dtypes in the DataFrame. \n\nIf the common data type is object, DataFrame.to_numpy() will require copying data.\n'

In [19]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int64
E         category
F           object
dtype: object

In [20]:
df2.to_numpy()

array([[1.0, Timestamp('2023-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2023-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2023-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2023-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [21]:
# describe() shows a quick statistic summary of data
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.452256  0.348794  0.142453  0.266838
std    1.035006  1.401754  0.612565  1.069186
min   -0.735963 -1.864743 -0.528591 -1.145679
25%   -0.237924 -0.273901 -0.175296 -0.435101
50%    0.233287  0.593319 -0.124856  0.223518
75%    1.076554  0.975266  0.633744  0.994768
max    2.020277  2.231265  0.938520  1.702461

In [22]:
df = pd.DataFrame([[1,2,3],[6,5,4]],columns=['a','b','c'])
df

   a  b  c
0  1  2  3
1  6  5  4

In [23]:
#transpose the data (rows=>cols , cols=>rows)
df.T

   0  1
a  1  6
b  2  5
c  3  4

In [24]:
# sort indexes in descending order (0,1 => 1,0)
df.sort_index(axis=0,ascending=False)

   a  b  c
1  6  5  4
0  1  2  3

In [25]:
# sort columns in descending order (a,b,c => c,b,a)
df.sort_index(axis=1,ascending=False)

   c  b  a
0  3  2  1
1  4  5  6

In [26]:
df['a'] = [55,11]   #changing column 1 values
df

    a  b  c
0  55  2  3
1  11  5  4

In [27]:
#sort_values will sort the specified column by value
df.sort_values(by='a')

    a  b  c
1  11  5  4
0  55  2  3

In [28]:
df = pd.DataFrame([[55,55,55],[11,22,33],[44,44,44]],columns=['a','b','c'])
df

    a   b   c
0  55  55  55
1  11  22  33
2  44  44  44

In [29]:
#sort_vlaue for multiple columns
df.sort_values(by=['a','c'])

    a   b   c
1  11  22  33
2  44  44  44
0  55  55  55

### 6. Selection

In [30]:
#selecting a column
df['a']

0    55
1    11
2    44
Name: a, dtype: int64

In [31]:
#passing a silce : , selects matching rows
df[0:2]

    a   b   c
0  55  55  55
1  11  22  33

In [32]:
df = pd.DataFrame([[1, 2], [4, 5], [7, 8]],
     index=['cobra', 'viper', 'python'],
     columns=['max_speed', 'shield'])
df

        max_speed  shield
cobra           1       2
viper           4       5
python          7       8

## Selction by label

In [33]:
#getting a row information by its label
df.loc['viper']

max_speed    4
shield       5
Name: viper, dtype: int64

In [34]:
#select all rows(indexes) ,macthing to given columns
df.loc[:,['max_speed']]

        max_speed
cobra           1
viper           4
python          7

In [35]:
# for lable slicing,both end points are inclusive
df.loc['viper':'python',['max_speed']]

        max_speed
viper           4
python          7

In [36]:
# selecting a single row and single column label , return a scaler value
df.loc['python','max_speed']

7

In [37]:
#fast access to scaler value use, df.at()
df.at['viper','max_speed']

4

## Selection by position

In [38]:
df.iloc[0]  #gives the 0th index item info

max_speed    1
shield       2
Name: cobra, dtype: int64

In [39]:
df.iloc[1] #gives the 1st index item info

max_speed    4
shield       5
Name: viper, dtype: int64

In [40]:
df.iloc[2]  #gives the 2nd index item info

max_speed    7
shield       8
Name: python, dtype: int64

In [41]:
#slicing the rows and columns
df.iloc[0:2]

       max_speed  shield
cobra          1       2
viper          4       5

In [42]:
df.iloc[0:2,0:1]  #select 0,1 labels and 0 column

       max_speed
cobra          1
viper          4

In [43]:
df.iloc[[0,1],[0]]

       max_speed
cobra          1
viper          4

In [44]:
# for getting fast access
df.iat[0,1]

2

## Boolean Indexing

In [45]:
df

        max_speed  shield
cobra           1       2
viper           4       5
python          7       8

In [46]:
# select rows whwere max_speed is greater than 1
df[df['max_speed']>1]

        max_speed  shield
viper           4       5
python          7       8

In [47]:
#show where all in dataframe values are equal to one
df==1

        max_speed  shield
cobra        True   False
viper       False   False
python      False   False

In [48]:
df>1  #shows where in dataframe values are greater than 1

        max_speed  shield
cobra       False    True
viper        True    True
python       True    True

In [49]:
#to see the values also where condtion meet
df[df>1]   #where condition not meet it put NaN

        max_speed  shield
cobra         NaN       2
viper         4.0       5
python        7.0       8

In [50]:
df = pd.DataFrame({'fruits':['apple','mango','lichi','grapes'],
              'veges':['lemon','pea','onion','tomato']
             })
df

   fruits   veges
0   apple   lemon
1   mango     pea
2   lichi   onion
3  grapes  tomato

In [51]:
#checking for fav fruits and veges ---- using isin()  
fav_fruits=['apple','grapes']
fav_veges= ['pea','lemon']

res1 = df['fruits'].isin(fav_fruits,)
res1

0     True
1    False
2    False
3     True
Name: fruits, dtype: bool

In [52]:
res2 = df['veges'].isin(fav_veges)
res2

0     True
1     True
2    False
3    False
Name: veges, dtype: bool

In [53]:
#selecting rows that matches with isin() items list

df[df['fruits'].isin(['apple','mango'])]

  fruits  veges
0  apple  lemon
1  mango    pea

## Setting

In [54]:
data = {'name':['john','Batman','Letty'],'gender':['M','M','F']}

df = pd.DataFrame(data)
df

     name gender
0    john      M
1  Batman      M
2   Letty      F

In [55]:
new_data = {'age':[15,16,17]}
df1 = pd.DataFrame(new_data)
df1

   age
0   15
1   16
2   17

In [56]:
# how to join new data with old data
df['age'] = df1
df

     name gender  age
0    john      M   15
1  Batman      M   16
2   Letty      F   17

In [57]:
df['unwanted'] = [1,2,3]
df

     name gender  age  unwanted
0    john      M   15         1
1  Batman      M   16         2
2   Letty      F   17         3

In [58]:
#to delete a column we can use two ways


# del df['col_name']
#      (or)
# df.remove('col_name',axis=1)

In [59]:
del df['unwanted']
df

     name gender  age
0    john      M   15
1  Batman      M   16
2   Letty      F   17

In [60]:
# We want to change the batman to Bruce wane . how to do it?
# we have two methods to do changes

old_name = 'Batman'
new_name = 'Bruce wane'

df.loc[df['name']==old_name,'name'] = new_name         ##Method 1

In [61]:
df

         name gender  age
0        john      M   15
1  Bruce wane      M   16
2       Letty      F   17

In [62]:
df.at[0,'name'] = 'john cena'       ##Method 2

In [63]:
df

         name gender  age
0   john cena      M   15
1  Bruce wane      M   16
2       Letty      F   17

In [64]:
# setting value by position
df.iat[0,0] = 'Roman Rains'
df.iat[0,2]=18

In [65]:
df

          name gender  age
0  Roman Rains      M   18
1   Bruce wane      M   16
2        Letty      F   17

In [66]:
# we want to set age for below 18 people as below 18

#updating the age column

df['age'] = df['age'].astype(str)
df.loc[df['age']<='19','age'] = 'below 18'
df

          name gender       age
0  Roman Rains      M  below 18
1   Bruce wane      M  below 18
2        Letty      F  below 18

## Missing Data

In [67]:
# setindex

data = {'Item':['item1','item2','item3'],
       'stock':[10,20,2]}

df = pd.DataFrame(data)
df

    Item  stock
0  item1     10
1  item2     20
2  item3      2

In [68]:
df.set_index('Item',inplace=True)
df

       stock
Item
item1     10
item2     20
item3      2

In [69]:
# now we want to add all items in the dataframe, we will reuse reindex
#reindex()

all_items = ['item1','item2','item3','item4','item5']
df = df.reindex(index=all_items)
df

       stock
Item
item1   10.0
item2   20.0
item3    2.0
item4    NaN
item5    NaN

In [70]:
#dropna() : to remove the rows with values Na or NaN
df.dropna()

       stock
Item
item1   10.0
item2   20.0
item3    2.0

In [71]:
# to fill all Na or NaN values with a value , we use fillna()
df.fillna(0)

       stock
Item
item1   10.0
item2   20.0
item3    2.0
item4    0.0
item5    0.0

In [72]:
df = pd.DataFrame()
df['id'] = [101,102,103]
df['age'] = [10,12,16]
df['salary'] = [100,200,250]
df['married'] = [np.nan,np.nan,'Y']
df

    id  age  salary married
0  101   10     100     NaN
1  102   12     200     NaN
2  103   16     250       Y

In [73]:
#isna() : method to check which cells have NaN values
df.isna()

      id    age  salary  married
0  False  False   False     True
1  False  False   False     True
2  False  False   False    False

## Stats

In [74]:
df = pd.DataFrame()
df['marks1'] = [10,20,30]
df['marks2'] = [20,30,10]
df['marks3'] = [10,20,20]
df

   marks1  marks2  marks3
0      10      20      10
1      20      30      20
2      30      10      20

In [75]:
df.mean()  # mean for each column

marks1    20.000000
marks2    20.000000
marks3    16.666667
dtype: float64

In [76]:
 # "axis 0" refers to operations along rows, and "axis 1" refers to operations along columns in Pandas DataFrames.

In [77]:
df.mean(axis=1) #mean for each row

0    13.333333
1    23.333333
2    20.000000
dtype: float64

In [78]:
df.sum(axis=1)

0    40
1    70
2    60
dtype: int64

In [79]:
df.max(axis=1)

0    20
1    30
2    30
dtype: int64

In [80]:
df.min(axis=1)

0    10
1    20
2    10
dtype: int64

## User Defined Functions

In [81]:
#df.agg() , df.transform()
df

   marks1  marks2  marks3
0      10      20      10
1      20      30      20
2      30      10      20

In [82]:
df.agg({'marks1':'max','marks2':'sum','marks3':'min'})

marks1    30
marks2    60
marks3    10
dtype: int64

In [83]:
# adding extra 5 to each marks due to wrong question.
df.agg(lambda x : x+5)

   marks1  marks2  marks3
0      15      25      15
1      25      35      25
2      35      15      25

In [84]:
df

   marks1  marks2  marks3
0      10      20      10
1      20      30      20
2      30      10      20

In [85]:
row_summary = df.agg(['sum','max','min','mean'],axis=1)
row_summary

    sum   max   min       mean
0  40.0  20.0  10.0  13.333333
1  70.0  30.0  20.0  23.333333
2  60.0  30.0  10.0  20.000000

In [86]:
column_summary = df.agg(['sum','max'])
column_summary

     marks1  marks2  marks3
sum      60      60      50
max      30      30      20

In [87]:
df = pd.DataFrame({'Category': ['A', 'B', 'A', 'B', 'A'],
                   'Value': [10, 20, 15, 25, 30]})
df

  Category  Value
0        A     10
1        B     20
2        A     15
3        B     25
4        A     30

In [88]:
#df.transform()

df['mean'] = df.groupby('Category')['Value'].transform('mean')

In [89]:
df

  Category  Value       mean
0        A     10  18.333333
1        B     20  22.500000
2        A     15  18.333333
3        B     25  22.500000
4        A     30  18.333333

In [90]:
del df['mean']

In [91]:
df

  Category  Value
0        A     10
1        B     20
2        A     15
3        B     25
4        A     30

In [92]:
df.value_counts()

Category  Value
A         10       1
          15       1
          30       1
B         20       1
          25       1
Name: count, dtype: int64

In [93]:
data = [10,20,20,10,40]
ser = pd.Series(data)

In [94]:
ser

0    10
1    20
2    20
3    10
4    40
dtype: int64

In [95]:
ser.value_counts()

10    2
20    2
40    1
Name: count, dtype: int64

## String Methods

In [96]:
s = pd.Series(['Apple','Mango','Lichi'])
s

0    Apple
1    Mango
2    Lichi
dtype: object

In [97]:
s.str.lower()

0    apple
1    mango
2    lichi
dtype: object

In [98]:
len(s)

3

In [99]:
s.loc[0] , s.loc[1] , s.loc[2]

('Apple', 'Mango', 'Lichi')

In [100]:
df

  Category  Value
0        A     10
1        B     20
2        A     15
3        B     25
4        A     30

In [101]:
# adding new row in the dataframe
df.loc[len(df)] = ['Z',99]
df

  Category  Value
0        A     10
1        B     20
2        A     15
3        B     25
4        A     30
5        Z     99

In [102]:
# deleteing a record from dataset
df=df.drop([5])
df

  Category  Value
0        A     10
1        B     20
2        A     15
3        B     25
4        A     30

In [103]:
# adding and removing new columns
df['new_column'] = 0
df

  Category  Value  new_column
0        A     10           0
1        B     20           0
2        A     15           0
3        B     25           0
4        A     30           0

In [104]:
df = df.drop('new_column',axis=1)
df

  Category  Value
0        A     10
1        B     20
2        A     15
3        B     25
4        A     30

## Merge

In [105]:
# Create two sample DataFrames

data1 = {'Name': ['Alice', 'Bob', 'Charlie'],
         'Age': [25, 30, 35]}
df1 = pd.DataFrame(data1)

data2 = {'Name': ['David', 'Eva', 'Frank'],
         'Age': [28, 22, 40]}
df2 = pd.DataFrame(data2)

In [106]:
df1

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

In [107]:
df2

    Name  Age
0  David   28
1    Eva   22
2  Frank   40

In [108]:
pd.concat([df1,df2])

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35
0    David   28
1      Eva   22
2    Frank   40

In [109]:
pd.concat([df1,df2],ignore_index=True)

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35
3    David   28
4      Eva   22
5    Frank   40

In [110]:
# Merging in Pandas is used to combine data from different DataFrames based on a common key or keys. 
# Here's an example of how to use the merge() function to merge two DataFrames:

In [111]:
data1 = {'ID': [1, 2, 3],
         'Name': ['Alice', 'Bob', 'Charlie']}
df1 = pd.DataFrame(data1)

data2 = {'ID': [2, 3, 4],
         'Age': [25, 30, 35]}
df2 = pd.DataFrame(data2)

In [112]:
df1

   ID     Name
0   1    Alice
1   2      Bob
2   3  Charlie

In [113]:
df2

   ID  Age
0   2   25
1   3   30
2   4   35

In [114]:
# Merge DataFrames based on the 'ID' column (inner join by default)

merged_df = pd.merge(df1, df2, on='ID')

In [115]:
merged_df

   ID     Name  Age
0   2      Bob   25
1   3  Charlie   30

## Grouping

In [116]:
data = {'product':['A','H','Z','A','H'],
        'sales':[10,20,10,10,20],
       }
df = pd.DataFrame(data)
df

  product  sales
0       A     10
1       H     20
2       Z     10
3       A     10
4       H     20

In [117]:
#calculating total sales for each product
df.groupby('product')['sales'].sum()

product
A    20
H    40
Z    10
Name: sales, dtype: int64

In [118]:
df['category'] = ['food','vegy','toys','food','vegy']
df

  product  sales category
0       A     10     food
1       H     20     vegy
2       Z     10     toys
3       A     10     food
4       H     20     vegy

In [119]:
# calculating total sales of each category
df.groupby('category')['sales'].sum()

category
food    20
toys    10
vegy    40
Name: sales, dtype: int64

In [120]:
df['discount'] = [5,2,1,1,2]
df

  product  sales category  discount
0       A     10     food         5
1       H     20     vegy         2
2       Z     10     toys         1
3       A     10     food         1
4       H     20     vegy         2

In [121]:
df.groupby('category')[['sales','discount']].sum()

          sales  discount
category
food         20         6
toys         10         1
vegy         40         4

In [122]:
# The stack() method “compresses” a level in the DataFrame’s columns:

In [123]:
data = { 'days':['mon','tues','wed','thurs','fri','sat','sun'],
         'A_sales' : [10,20,10,30,20,10,30],
         'B_sales':  [10,20,30,40,50,60,10]
}
df = pd.DataFrame(data)
df

    days  A_sales  B_sales
0    mon       10       10
1   tues       20       20
2    wed       10       30
3  thurs       30       40
4    fri       20       50
5    sat       10       60
6    sun       30       10

In [124]:
stacked = df.set_index('days').stack()
stacked

days
mon    A_sales    10
       B_sales    10
tues   A_sales    20
       B_sales    20
wed    A_sales    10
       B_sales    30
thurs  A_sales    30
       B_sales    40
fri    A_sales    20
       B_sales    50
sat    A_sales    10
       B_sales    60
sun    A_sales    30
       B_sales    10
dtype: int64

In [125]:
#creating new column total_sales
df['total_sales'] = df['A_sales']+df['B_sales']
df

    days  A_sales  B_sales  total_sales
0    mon       10       10           20
1   tues       20       20           40
2    wed       10       30           40
3  thurs       30       40           70
4    fri       20       50           70
5    sat       10       60           70
6    sun       30       10           40

In [126]:
stacked.unstack()

       A_sales  B_sales
days
mon         10       10
tues        20       20
wed         10       30
thurs       30       40
fri         20       50
sat         10       60
sun         30       10

In [127]:
# pivot_table()
data = {
    'Product': ['A', 'B', 'A', 'B', 'A'],
    'Region': ['North', 'North', 'South', 'South', 'West'],
    'Sales': [100, 150, 120, 200, 80]
}

df = pd.DataFrame(data)
df

  Product Region  Sales
0       A  North    100
1       B  North    150
2       A  South    120
3       B  South    200
4       A   West     80

In [128]:
df.pivot_table(index='Product',values='Sales',columns='Region',fill_value='missing')

Region   North  South     West
Product
A        100.0  120.0     80.0
B        150.0  200.0  missing